zephyrproject-rtos/hal_nxp/dts/nxp/imxrt/imxrt5xx/pinctrl/MIMXRT533SFAWC-pinctrl.h
/*
 * NOTE: File generated by gen_soc_headers.py
 * from MIMXRT533SFAWC/signal_configuration.xml
 *
 * Copyright 2024, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MIMXRT595SFFOC-pinctrl.h with this part's differences applied
 * below (1114 removed, 0 changed,
 * 103 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 562b080ddd1196b6
 */

#ifndef _ZEPHYR_DTS_BINDING_MIMXRT533SFAWC_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MIMXRT533SFAWC_WRAPPER_

#include "MIMXRT595SFFOC-pinctrl.h"

/* Signals not present on this part */
#undef ACMP0_ACMP_IN5_PIO3_14
#undef ADC0_CH6_PIO4_18
#undef CLKIN_PIO4_1
#undef CLKOUT_PIO1_10
#undef CLKOUT_PIO4_0
#undef CMP0_OUT_PIO3_3
#undef CTIMER0_CAPTURE0_PIO1_10
#undef CTIMER0_CAPTURE0_PIO1_29
#undef CTIMER0_CAPTURE0_PIO3_12
#undef CTIMER0_CAPTURE0_PIO3_13
#undef CTIMER0_CAPTURE1_PIO1_10
#undef CTIMER0_CAPTURE1_PIO1_29
#undef CTIMER0_CAPTURE1_PIO3_12
#undef CTIMER0_CAPTURE1_PIO3_13
#undef CTIMER0_CAPTURE2_PIO1_10
#undef CTIMER0_CAPTURE2_PIO1_29
#undef CTIMER0_CAPTURE2_PIO3_12
#undef CTIMER0_CAPTURE2_PIO3_13
#undef CTIMER0_CAPTURE3_PIO1_10
#undef CTIMER0_CAPTURE3_PIO1_29
#undef CTIMER0_CAPTURE3_PIO3_12
#undef CTIMER0_CAPTURE3_PIO3_13
#undef CTIMER0_MATCH0_PIO3_8
#undef CTIMER0_MATCH1_PIO3_9
#undef CTIMER0_MATCH2_PIO3_10
#undef CTIMER0_MATCH3_PIO3_11
#undef CTIMER1_CAPTURE0_PIO1_10
#undef CTIMER1_CAPTURE0_PIO1_29
#undef CTIMER1_CAPTURE0_PIO3_12
#undef CTIMER1_CAPTURE0_PIO3_13
#undef CTIMER1_CAPTURE1_PIO1_10
#undef CTIMER1_CAPTURE1_PIO1_29
#undef CTIMER1_CAPTURE1_PIO3_12
#undef CTIMER1_CAPTURE1_PIO3_13
#undef CTIMER1_CAPTURE2_PIO1_10
#undef CTIMER1_CAPTURE2_PIO1_29
#undef CTIMER1_CAPTURE2_PIO3_12
#undef CTIMER1_CAPTURE2_PIO3_13
#undef CTIMER1_CAPTURE3_PIO1_10
#undef CTIMER1_CAPTURE3_PIO1_29
#undef CTIMER1_CAPTURE3_PIO3_12
#undef CTIMER1_CAPTURE3_PIO3_13
#undef CTIMER1_MATCH0_PIO2_6
#undef CTIMER1_MATCH1_PIO2_7
#undef CTIMER1_MATCH2_PIO2_8
#undef CTIMER1_MATCH3_PIO2_9
#undef CTIMER2_CAPTURE0_PIO1_10
#undef CTIMER2_CAPTURE0_PIO1_29
#undef CTIMER2_CAPTURE0_PIO3_12
#undef CTIMER2_CAPTURE0_PIO3_13
#undef CTIMER2_CAPTURE1_PIO1_10
#undef CTIMER2_CAPTURE1_PIO1_29
#undef CTIMER2_CAPTURE1_PIO3_12
#undef CTIMER2_CAPTURE1_PIO3_13
#undef CTIMER2_CAPTURE2_PIO1_10
#undef CTIMER2_CAPTURE2_PIO1_29
#undef CTIMER2_CAPTURE2_PIO3_12
#undef CTIMER2_CAPTURE2_PIO3_13
#undef CTIMER2_CAPTURE3_PIO1_10
#undef CTIMER2_CAPTURE3_PIO1_29
#undef CTIMER2_CAPTURE3_PIO3_12
#undef CTIMER2_CAPTURE3_PIO3_13
#undef CTIMER2_MATCH0_PIO2_10
#undef CTIMER2_MATCH1_PIO2_11
#undef CTIMER3_CAPTURE0_PIO1_10
#undef CTIMER3_CAPTURE0_PIO1_29
#undef CTIMER3_CAPTURE0_PIO3_12
#undef CTIMER3_CAPTURE0_PIO3_13
#undef CTIMER3_CAPTURE1_PIO1_10
#undef CTIMER3_CAPTURE1_PIO1_29
#undef CTIMER3_CAPTURE1_PIO3_12
#undef CTIMER3_CAPTURE1_PIO3_13
#undef CTIMER3_CAPTURE2_PIO1_10
#undef CTIMER3_CAPTURE2_PIO1_29
#undef CTIMER3_CAPTURE2_PIO3_12
#undef CTIMER3_CAPTURE2_PIO3_13
#undef CTIMER3_CAPTURE3_PIO1_10
#undef CTIMER3_CAPTURE3_PIO1_29
#undef CTIMER3_CAPTURE3_PIO3_12
#undef CTIMER3_CAPTURE3_PIO3_13
#undef CTIMER3_MATCH0_PIO3_14
#undef CTIMER3_MATCH1_PIO3_15
#undef CTIMER3_MATCH2_PIO3_16
#undef CTIMER3_MATCH3_PIO3_17
#undef CTIMER4_CAPTURE0_PIO1_10
#undef CTIMER4_CAPTURE0_PIO1_29
#undef CTIMER4_CAPTURE0_PIO3_12
#undef CTIMER4_CAPTURE0_PIO3_13
#undef CTIMER4_CAPTURE1_PIO1_10
#undef CTIMER4_CAPTURE1_PIO1_29
#undef CTIMER4_CAPTURE1_PIO3_12
#undef CTIMER4_CAPTURE1_PIO3_13
#undef CTIMER4_CAPTURE2_PIO1_10
#undef CTIMER4_CAPTURE2_PIO1_29
#undef CTIMER4_CAPTURE2_PIO3_12
#undef CTIMER4_CAPTURE2_PIO3_13
#undef CTIMER4_CAPTURE3_PIO1_10
#undef CTIMER4_CAPTURE3_PIO1_29
#undef CTIMER4_CAPTURE3_PIO3_12
#undef CTIMER4_CAPTURE3_PIO3_13
#undef CTIMER4_MATCH0_PIO3_18
#undef CTIMER4_MATCH1_PIO3_19
#undef CTIMER4_MATCH2_PIO3_20
#undef CTIMER4_MATCH3_PIO3_21
#undef DBI_CSX_PIO4_20
#undef DBI_DSX_PIO4_21
#undef DBI_E_PIO4_25
#undef DBI_RWDX_PIO4_23
#undef DBI_WRX_PIO4_24
#undef DMA0_TRIG0_PIO1_10
#undef DMA0_TRIG0_PIO1_24
#undef DMA0_TRIG0_PIO1_25
#undef DMA0_TRIG0_PIO1_26
#undef DMA0_TRIG0_PIO1_27
#undef DMA0_TRIG0_PIO1_29
#undef DMA0_TRIG0_PIO1_30
#undef DMA0_TRIG0_PIO1_31
#undef DMA0_TRIG10_PIO1_10
#undef DMA0_TRIG10_PIO1_24
#undef DMA0_TRIG10_PIO1_25
#undef DMA0_TRIG10_PIO1_26
#undef DMA0_TRIG10_PIO1_27
#undef DMA0_TRIG10_PIO1_29
#undef DMA0_TRIG10_PIO1_30
#undef DMA0_TRIG10_PIO1_31
#undef DMA0_TRIG11_PIO1_10
#undef DMA0_TRIG11_PIO1_24
#undef DMA0_TRIG11_PIO1_25
#undef DMA0_TRIG11_PIO1_26
#undef DMA0_TRIG11_PIO1_27
#undef DMA0_TRIG11_PIO1_29
#undef DMA0_TRIG11_PIO1_30
#undef DMA0_TRIG11_PIO1_31
#undef DMA0_TRIG12_PIO1_10
#undef DMA0_TRIG12_PIO1_24
#undef DMA0_TRIG12_PIO1_25
#undef DMA0_TRIG12_PIO1_26
#undef DMA0_TRIG12_PIO1_27
#undef DMA0_TRIG12_PIO1_29
#undef DMA0_TRIG12_PIO1_30
#undef DMA0_TRIG12_PIO1_31
#undef DMA0_TRIG13_PIO1_10
#undef DMA0_TRIG13_PIO1_24
#undef DMA0_TRIG13_PIO1_25
#undef DMA0_TRIG13_PIO1_26
#undef DMA0_TRIG13_PIO1_27
#undef DMA0_TRIG13_PIO1_29
#undef DMA0_TRIG13_PIO1_30
#undef DMA0_TRIG13_PIO1_31
#undef DMA0_TRIG14_PIO1_10
#undef DMA0_TRIG14_PIO1_24
#undef DMA0_TRIG14_PIO1_25
#undef DMA0_TRIG14_PIO1_26
#undef DMA0_TRIG14_PIO1_27
#undef DMA0_TRIG14_PIO1_29
#undef DMA0_TRIG14_PIO1_30
#undef DMA0_TRIG14_PIO1_31
#undef DMA0_TRIG15_PIO1_10
#undef DMA0_TRIG15_PIO1_24
#undef DMA0_TRIG15_PIO1_25
#undef DMA0_TRIG15_PIO1_26
#undef DMA0_TRIG15_PIO1_27
#undef DMA0_TRIG15_PIO1_29
#undef DMA0_TRIG15_PIO1_30
#undef DMA0_TRIG15_PIO1_31
#undef DMA0_TRIG16_PIO1_10
#undef DMA0_TRIG16_PIO1_24
#undef DMA0_TRIG16_PIO1_25
#undef DMA0_TRIG16_PIO1_26
#undef DMA0_TRIG16_PIO1_27
#undef DMA0_TRIG16_PIO1_29
#undef DMA0_TRIG16_PIO1_30
#undef DMA0_TRIG16_PIO1_31
#undef DMA0_TRIG17_PIO1_10
#undef DMA0_TRIG17_PIO1_24
#undef DMA0_TRIG17_PIO1_25
#undef DMA0_TRIG17_PIO1_26
#undef DMA0_TRIG17_PIO1_27
#undef DMA0_TRIG17_PIO1_29
#undef DMA0_TRIG17_PIO1_30
#undef DMA0_TRIG17_PIO1_31
#undef DMA0_TRIG18_PIO1_10
#undef DMA0_TRIG18_PIO1_24
#undef DMA0_TRIG18_PIO1_25
#undef DMA0_TRIG18_PIO1_26
#undef DMA0_TRIG18_PIO1_27
#undef DMA0_TRIG18_PIO1_29
#undef DMA0_TRIG18_PIO1_30
#undef DMA0_TRIG18_PIO1_31
#undef DMA0_TRIG19_PIO1_10
#undef DMA0_TRIG19_PIO1_24
#undef DMA0_TRIG19_PIO1_25
#undef DMA0_TRIG19_PIO1_26
#undef DMA0_TRIG19_PIO1_27
#undef DMA0_TRIG19_PIO1_29
#undef DMA0_TRIG19_PIO1_30
#undef DMA0_TRIG19_PIO1_31
#undef DMA0_TRIG1_PIO1_10
#undef DMA0_TRIG1_PIO1_24
#undef DMA0_TRIG1_PIO1_25
#undef DMA0_TRIG1_PIO1_26
#undef DMA0_TRIG1_PIO1_27
#undef DMA0_TRIG1_PIO1_29
#undef DMA0_TRIG1_PIO1_30
#undef DMA0_TRIG1_PIO1_31
#undef DMA0_TRIG20_PIO1_10
#undef DMA0_TRIG20_PIO1_24
#undef DMA0_TRIG20_PIO1_25
#undef DMA0_TRIG20_PIO1_26
#undef DMA0_TRIG20_PIO1_27
#undef DMA0_TRIG20_PIO1_29
#undef DMA0_TRIG20_PIO1_30
#undef DMA0_TRIG20_PIO1_31
#undef DMA0_TRIG21_PIO1_10
#undef DMA0_TRIG21_PIO1_24
#undef DMA0_TRIG21_PIO1_25
#undef DMA0_TRIG21_PIO1_26
#undef DMA0_TRIG21_PIO1_27
#undef DMA0_TRIG21_PIO1_29
#undef DMA0_TRIG21_PIO1_30
#undef DMA0_TRIG21_PIO1_31
#undef DMA0_TRIG22_PIO1_10
#undef DMA0_TRIG22_PIO1_24
#undef DMA0_TRIG22_PIO1_25
#undef DMA0_TRIG22_PIO1_26
#undef DMA0_TRIG22_PIO1_27
#undef DMA0_TRIG22_PIO1_29
#undef DMA0_TRIG22_PIO1_30
#undef DMA0_TRIG22_PIO1_31
#undef DMA0_TRIG23_PIO1_10
#undef DMA0_TRIG23_PIO1_24
#undef DMA0_TRIG23_PIO1_25
#undef DMA0_TRIG23_PIO1_26
#undef DMA0_TRIG23_PIO1_27
#undef DMA0_TRIG23_PIO1_29
#undef DMA0_TRIG23_PIO1_30
#undef DMA0_TRIG23_PIO1_31
#undef DMA0_TRIG24_PIO1_10
#undef DMA0_TRIG24_PIO1_24
#undef DMA0_TRIG24_PIO1_25
#undef DMA0_TRIG24_PIO1_26
#undef DMA0_TRIG24_PIO1_27
#undef DMA0_TRIG24_PIO1_29
#undef DMA0_TRIG24_PIO1_30
#undef DMA0_TRIG24_PIO1_31
#undef DMA0_TRIG25_PIO1_10
#undef DMA0_TRIG25_PIO1_24
#undef DMA0_TRIG25_PIO1_25
#undef DMA0_TRIG25_PIO1_26
#undef DMA0_TRIG25_PIO1_27
#undef DMA0_TRIG25_PIO1_29
#undef DMA0_TRIG25_PIO1_30
#undef DMA0_TRIG25_PIO1_31
#undef DMA0_TRIG26_PIO1_10
#undef DMA0_TRIG26_PIO1_24
#undef DMA0_TRIG26_PIO1_25
#undef DMA0_TRIG26_PIO1_26
#undef DMA0_TRIG26_PIO1_27
#undef DMA0_TRIG26_PIO1_29
#undef DMA0_TRIG26_PIO1_30
#undef DMA0_TRIG26_PIO1_31
#undef DMA0_TRIG27_PIO1_10
#undef DMA0_TRIG27_PIO1_24
#undef DMA0_TRIG27_PIO1_25
#undef DMA0_TRIG27_PIO1_26
#undef DMA0_TRIG27_PIO1_27
#undef DMA0_TRIG27_PIO1_29
#undef DMA0_TRIG27_PIO1_30
#undef DMA0_TRIG27_PIO1_31
#undef DMA0_TRIG28_PIO1_10
#undef DMA0_TRIG28_PIO1_24
#undef DMA0_TRIG28_PIO1_25
#undef DMA0_TRIG28_PIO1_26
#undef DMA0_TRIG28_PIO1_27
#undef DMA0_TRIG28_PIO1_29
#undef DMA0_TRIG28_PIO1_30
#undef DMA0_TRIG28_PIO1_31
#undef DMA0_TRIG29_PIO1_10
#undef DMA0_TRIG29_PIO1_24
#undef DMA0_TRIG29_PIO1_25
#undef DMA0_TRIG29_PIO1_26
#undef DMA0_TRIG29_PIO1_27
#undef DMA0_TRIG29_PIO1_29
#undef DMA0_TRIG29_PIO1_30
#undef DMA0_TRIG29_PIO1_31
#undef DMA0_TRIG2_PIO1_10
#undef DMA0_TRIG2_PIO1_24
#undef DMA0_TRIG2_PIO1_25
#undef DMA0_TRIG2_PIO1_26
#undef DMA0_TRIG2_PIO1_27
#undef DMA0_TRIG2_PIO1_29
#undef DMA0_TRIG2_PIO1_30
#undef DMA0_TRIG2_PIO1_31
#undef DMA0_TRIG30_PIO1_10
#undef DMA0_TRIG30_PIO1_24
#undef DMA0_TRIG30_PIO1_25
#undef DMA0_TRIG30_PIO1_26
#undef DMA0_TRIG30_PIO1_27
#undef DMA0_TRIG30_PIO1_29
#undef DMA0_TRIG30_PIO1_30
#undef DMA0_TRIG30_PIO1_31
#undef DMA0_TRIG31_PIO1_10
#undef DMA0_TRIG31_PIO1_24
#undef DMA0_TRIG31_PIO1_25
#undef DMA0_TRIG31_PIO1_26
#undef DMA0_TRIG31_PIO1_27
#undef DMA0_TRIG31_PIO1_29
#undef DMA0_TRIG31_PIO1_30
#undef DMA0_TRIG31_PIO1_31
#undef DMA0_TRIG32_PIO1_10
#undef DMA0_TRIG32_PIO1_24
#undef DMA0_TRIG32_PIO1_25
#undef DMA0_TRIG32_PIO1_26
#undef DMA0_TRIG32_PIO1_27
#undef DMA0_TRIG32_PIO1_29
#undef DMA0_TRIG32_PIO1_30
#undef DMA0_TRIG32_PIO1_31
#undef DMA0_TRIG33_PIO1_10
#undef DMA0_TRIG33_PIO1_24
#undef DMA0_TRIG33_PIO1_25
#undef DMA0_TRIG33_PIO1_26
#undef DMA0_TRIG33_PIO1_27
#undef DMA0_TRIG33_PIO1_29
#undef DMA0_TRIG33_PIO1_30
#undef DMA0_TRIG33_PIO1_31
#undef DMA0_TRIG34_PIO1_10
#undef DMA0_TRIG34_PIO1_24
#undef DMA0_TRIG34_PIO1_25
#undef DMA0_TRIG34_PIO1_26
#undef DMA0_TRIG34_PIO1_27
#undef DMA0_TRIG34_PIO1_29
#undef DMA0_TRIG34_PIO1_30
#undef DMA0_TRIG34_PIO1_31
#undef DMA0_TRIG35_PIO1_10
#undef DMA0_TRIG35_PIO1_24
#undef DMA0_TRIG35_PIO1_25
#undef DMA0_TRIG35_PIO1_26
#undef DMA0_TRIG35_PIO1_27
#undef DMA0_TRIG35_PIO1_29
#undef DMA0_TRIG35_PIO1_30
#undef DMA0_TRIG35_PIO1_31
#undef DMA0_TRIG36_PIO1_10
#undef DMA0_TRIG36_PIO1_24
#undef DMA0_TRIG36_PIO1_25
#undef DMA0_TRIG36_PIO1_26
#undef DMA0_TRIG36_PIO1_27
#undef DMA0_TRIG36_PIO1_29
#undef DMA0_TRIG36_PIO1_30
#undef DMA0_TRIG36_PIO1_31
#undef DMA0_TRIG3_PIO1_10
#undef DMA0_TRIG3_PIO1_24
#undef DMA0_TRIG3_PIO1_25
#undef DMA0_TRIG3_PIO1_26
#undef DMA0_TRIG3_PIO1_27
#undef DMA0_TRIG3_PIO1_29
#undef DMA0_TRIG3_PIO1_30
#undef DMA0_TRIG3_PIO1_31
#undef DMA0_TRIG4_PIO1_10
#undef DMA0_TRIG4_PIO1_24
#undef DMA0_TRIG4_PIO1_25
#undef DMA0_TRIG4_PIO1_26
#undef DMA0_TRIG4_PIO1_27
#undef DMA0_TRIG4_PIO1_29
#undef DMA0_TRIG4_PIO1_30
#undef DMA0_TRIG4_PIO1_31
#undef DMA0_TRIG5_PIO1_10
#undef DMA0_TRIG5_PIO1_24
#undef DMA0_TRIG5_PIO1_25
#undef DMA0_TRIG5_PIO1_26
#undef DMA0_TRIG5_PIO1_27
#undef DMA0_TRIG5_PIO1_29
#undef DMA0_TRIG5_PIO1_30
#undef DMA0_TRIG5_PIO1_31
#undef DMA0_TRIG6_PIO1_10
#undef DMA0_TRIG6_PIO1_24
#undef DMA0_TRIG6_PIO1_25
#undef DMA0_TRIG6_PIO1_26
#undef DMA0_TRIG6_PIO1_27
#undef DMA0_TRIG6_PIO1_29
#undef DMA0_TRIG6_PIO1_30
#undef DMA0_TRIG6_PIO1_31
#undef DMA0_TRIG7_PIO1_10
#undef DMA0_TRIG7_PIO1_24
#undef DMA0_TRIG7_PIO1_25
#undef DMA0_TRIG7_PIO1_26
#undef DMA0_TRIG7_PIO1_27
#undef DMA0_TRIG7_PIO1_29
#undef DMA0_TRIG7_PIO1_30
#undef DMA0_TRIG7_PIO1_31
#undef DMA0_TRIG8_PIO1_10
#undef DMA0_TRIG8_PIO1_24
#undef DMA0_TRIG8_PIO1_25
#undef DMA0_TRIG8_PIO1_26
#undef DMA0_TRIG8_PIO1_27
#undef DMA0_TRIG8_PIO1_29
#undef DMA0_TRIG8_PIO1_30
#undef DMA0_TRIG8_PIO1_31
#undef DMA0_TRIG9_PIO1_10
#undef DMA0_TRIG9_PIO1_24
#undef DMA0_TRIG9_PIO1_25
#undef DMA0_TRIG9_PIO1_26
#undef DMA0_TRIG9_PIO1_27
#undef DMA0_TRIG9_PIO1_29
#undef DMA0_TRIG9_PIO1_30
#undef DMA0_TRIG9_PIO1_31
#undef DMA1_TRIG0_PIO1_10
#undef DMA1_TRIG0_PIO1_24
#undef DMA1_TRIG0_PIO1_25
#undef DMA1_TRIG0_PIO1_26
#undef DMA1_TRIG0_PIO1_27
#undef DMA1_TRIG0_PIO1_29
#undef DMA1_TRIG0_PIO1_30
#undef DMA1_TRIG0_PIO1_31
#undef DMA1_TRIG10_PIO1_10
#undef DMA1_TRIG10_PIO1_24
#undef DMA1_TRIG10_PIO1_25
#undef DMA1_TRIG10_PIO1_26
#undef DMA1_TRIG10_PIO1_27
#undef DMA1_TRIG10_PIO1_29
#undef DMA1_TRIG10_PIO1_30
#undef DMA1_TRIG10_PIO1_31
#undef DMA1_TRIG11_PIO1_10
#undef DMA1_TRIG11_PIO1_24
#undef DMA1_TRIG11_PIO1_25
#undef DMA1_TRIG11_PIO1_26
#undef DMA1_TRIG11_PIO1_27
#undef DMA1_TRIG11_PIO1_29
#undef DMA1_TRIG11_PIO1_30
#undef DMA1_TRIG11_PIO1_31
#undef DMA1_TRIG12_PIO1_10
#undef DMA1_TRIG12_PIO1_24
#undef DMA1_TRIG12_PIO1_25
#undef DMA1_TRIG12_PIO1_26
#undef DMA1_TRIG12_PIO1_27
#undef DMA1_TRIG12_PIO1_29
#undef DMA1_TRIG12_PIO1_30
#undef DMA1_TRIG12_PIO1_31
#undef DMA1_TRIG13_PIO1_10
#undef DMA1_TRIG13_PIO1_24
#undef DMA1_TRIG13_PIO1_25
#undef DMA1_TRIG13_PIO1_26
#undef DMA1_TRIG13_PIO1_27
#undef DMA1_TRIG13_PIO1_29
#undef DMA1_TRIG13_PIO1_30
#undef DMA1_TRIG13_PIO1_31
#undef DMA1_TRIG14_PIO1_10
#undef DMA1_TRIG14_PIO1_24
#undef DMA1_TRIG14_PIO1_25
#undef DMA1_TRIG14_PIO1_26
#undef DMA1_TRIG14_PIO1_27
#undef DMA1_TRIG14_PIO1_29
#undef DMA1_TRIG14_PIO1_30
#undef DMA1_TRIG14_PIO1_31
#undef DMA1_TRIG15_PIO1_10
#undef DMA1_TRIG15_PIO1_24
#undef DMA1_TRIG15_PIO1_25
#undef DMA1_TRIG15_PIO1_26
#undef DMA1_TRIG15_PIO1_27
#undef DMA1_TRIG15_PIO1_29
#undef DMA1_TRIG15_PIO1_30
#undef DMA1_TRIG15_PIO1_31
#undef DMA1_TRIG16_PIO1_10
#undef DMA1_TRIG16_PIO1_24
#undef DMA1_TRIG16_PIO1_25
#undef DMA1_TRIG16_PIO1_26
#undef DMA1_TRIG16_PIO1_27
#undef DMA1_TRIG16_PIO1_29
#undef DMA1_TRIG16_PIO1_30
#undef DMA1_TRIG16_PIO1_31
#undef DMA1_TRIG17_PIO1_10
#undef DMA1_TRIG17_PIO1_24
#undef DMA1_TRIG17_PIO1_25
#undef DMA1_TRIG17_PIO1_26
#undef DMA1_TRIG17_PIO1_27
#undef DMA1_TRIG17_PIO1_29
#undef DMA1_TRIG17_PIO1_30
#undef DMA1_TRIG17_PIO1_31
#undef DMA1_TRIG18_PIO1_10
#undef DMA1_TRIG18_PIO1_24
#undef DMA1_TRIG18_PIO1_25
#undef DMA1_TRIG18_PIO1_26
#undef DMA1_TRIG18_PIO1_27
#undef DMA1_TRIG18_PIO1_29
#undef DMA1_TRIG18_PIO1_30
#undef DMA1_TRIG18_PIO1_31
#undef DMA1_TRIG19_PIO1_10
#undef DMA1_TRIG19_PIO1_24
#undef DMA1_TRIG19_PIO1_25
#undef DMA1_TRIG19_PIO1_26
#undef DMA1_TRIG19_PIO1_27
#undef DMA1_TRIG19_PIO1_29
#undef DMA1_TRIG19_PIO1_30
#undef DMA1_TRIG19_PIO1_31
#undef DMA1_TRIG1_PIO1_10
#undef DMA1_TRIG1_PIO1_24
#undef DMA1_TRIG1_PIO1_25
#undef DMA1_TRIG1_PIO1_26
#undef DMA1_TRIG1_PIO1_27
#undef DMA1_TRIG1_PIO1_29
#undef DMA1_TRIG1_PIO1_30
#undef DMA1_TRIG1_PIO1_31
#undef DMA1_TRIG20_PIO1_10
#undef DMA1_TRIG20_PIO1_24
#undef DMA1_TRIG20_PIO1_25
#undef DMA1_TRIG20_PIO1_26
#undef DMA1_TRIG20_PIO1_27
#undef DMA1_TRIG20_PIO1_29
#undef DMA1_TRIG20_PIO1_30
#undef DMA1_TRIG20_PIO1_31
#undef DMA1_TRIG21_PIO1_10
#undef DMA1_TRIG21_PIO1_24
#undef DMA1_TRIG21_PIO1_25
#undef DMA1_TRIG21_PIO1_26
#undef DMA1_TRIG21_PIO1_27
#undef DMA1_TRIG21_PIO1_29
#undef DMA1_TRIG21_PIO1_30
#undef DMA1_TRIG21_PIO1_31
#undef DMA1_TRIG22_PIO1_10
#undef DMA1_TRIG22_PIO1_24
#undef DMA1_TRIG22_PIO1_25
#undef DMA1_TRIG22_PIO1_26
#undef DMA1_TRIG22_PIO1_27
#undef DMA1_TRIG22_PIO1_29
#undef DMA1_TRIG22_PIO1_30
#undef DMA1_TRIG22_PIO1_31
#undef DMA1_TRIG23_PIO1_10
#undef DMA1_TRIG23_PIO1_24
#undef DMA1_TRIG23_PIO1_25
#undef DMA1_TRIG23_PIO1_26
#undef DMA1_TRIG23_PIO1_27
#undef DMA1_TRIG23_PIO1_29
#undef DMA1_TRIG23_PIO1_30
#undef DMA1_TRIG23_PIO1_31
#undef DMA1_TRIG24_PIO1_10
#undef DMA1_TRIG24_PIO1_24
#undef DMA1_TRIG24_PIO1_25
#undef DMA1_TRIG24_PIO1_26
#undef DMA1_TRIG24_PIO1_27
#undef DMA1_TRIG24_PIO1_29
#undef DMA1_TRIG24_PIO1_30
#undef DMA1_TRIG24_PIO1_31
#undef DMA1_TRIG25_PIO1_10
#undef DMA1_TRIG25_PIO1_24
#undef DMA1_TRIG25_PIO1_25
#undef DMA1_TRIG25_PIO1_26
#undef DMA1_TRIG25_PIO1_27
#undef DMA1_TRIG25_PIO1_29
#undef DMA1_TRIG25_PIO1_30
#undef DMA1_TRIG25_PIO1_31
#undef DMA1_TRIG26_PIO1_10
#undef DMA1_TRIG26_PIO1_24
#undef DMA1_TRIG26_PIO1_25
#undef DMA1_TRIG26_PIO1_26
#undef DMA1_TRIG26_PIO1_27
#undef DMA1_TRIG26_PIO1_29
#undef DMA1_TRIG26_PIO1_30
#undef DMA1_TRIG26_PIO1_31
#undef DMA1_TRIG27_PIO1_10
#undef DMA1_TRIG27_PIO1_24
#undef DMA1_TRIG27_PIO1_25
#undef DMA1_TRIG27_PIO1_26
#undef DMA1_TRIG27_PIO1_27
#undef DMA1_TRIG27_PIO1_29
#undef DMA1_TRIG27_PIO1_30
#undef DMA1_TRIG27_PIO1_31
#undef DMA1_TRIG28_PIO1_10
#undef DMA1_TRIG28_PIO1_24
#undef DMA1_TRIG28_PIO1_25
#undef DMA1_TRIG28_PIO1_26
#undef DMA1_TRIG28_PIO1_27
#undef DMA1_TRIG28_PIO1_29
#undef DMA1_TRIG28_PIO1_30
#undef DMA1_TRIG28_PIO1_31
#undef DMA1_TRIG29_PIO1_10
#undef DMA1_TRIG29_PIO1_24
#undef DMA1_TRIG29_PIO1_25
#undef DMA1_TRIG29_PIO1_26
#undef DMA1_TRIG29_PIO1_27
#undef DMA1_TRIG29_PIO1_29
#undef DMA1_TRIG29_PIO1_30
#undef DMA1_TRIG29_PIO1_31
#undef DMA1_TRIG2_PIO1_10
#undef DMA1_TRIG2_PIO1_24
#undef DMA1_TRIG2_PIO1_25
#undef DMA1_TRIG2_PIO1_26
#undef DMA1_TRIG2_PIO1_27
#undef DMA1_TRIG2_PIO1_29
#undef DMA1_TRIG2_PIO1_30
#undef DMA1_TRIG2_PIO1_31
#undef DMA1_TRIG30_PIO1_10
#undef DMA1_TRIG30_PIO1_24
#undef DMA1_TRIG30_PIO1_25
#undef DMA1_TRIG30_PIO1_26
#undef DMA1_TRIG30_PIO1_27
#undef DMA1_TRIG30_PIO1_29
#undef DMA1_TRIG30_PIO1_30
#undef DMA1_TRIG30_PIO1_31
#undef DMA1_TRIG31_PIO1_10
#undef DMA1_TRIG31_PIO1_24
#undef DMA1_TRIG31_PIO1_25
#undef DMA1_TRIG31_PIO1_26
#undef DMA1_TRIG31_PIO1_27
#undef DMA1_TRIG31_PIO1_29
#undef DMA1_TRIG31_PIO1_30
#undef DMA1_TRIG31_PIO1_31
#undef DMA1_TRIG32_PIO1_10
#undef DMA1_TRIG32_PIO1_24
#undef DMA1_TRIG32_PIO1_25
#undef DMA1_TRIG32_PIO1_26
#undef DMA1_TRIG32_PIO1_27
#undef DMA1_TRIG32_PIO1_29
#undef DMA1_TRIG32_PIO1_30
#undef DMA1_TRIG32_PIO1_31
#undef DMA1_TRIG33_PIO1_10
#undef DMA1_TRIG33_PIO1_24
#undef DMA1_TRIG33_PIO1_25
#undef DMA1_TRIG33_PIO1_26
#undef DMA1_TRIG33_PIO1_27
#undef DMA1_TRIG33_PIO1_29
#undef DMA1_TRIG33_PIO1_30
#undef DMA1_TRIG33_PIO1_31
#undef DMA1_TRIG34_PIO1_10
#undef DMA1_TRIG34_PIO1_24
#undef DMA1_TRIG34_PIO1_25
#undef DMA1_TRIG34_PIO1_26
#undef DMA1_TRIG34_PIO1_27
#undef DMA1_TRIG34_PIO1_29
#undef DMA1_TRIG34_PIO1_30
#undef DMA1_TRIG34_PIO1_31
#undef DMA1_TRIG35_PIO1_10
#undef DMA1_TRIG35_PIO1_24
#undef DMA1_TRIG35_PIO1_25
#undef DMA1_TRIG35_PIO1_26
#undef DMA1_TRIG35_PIO1_27
#undef DMA1_TRIG35_PIO1_29
#undef DMA1_TRIG35_PIO1_30
#undef DMA1_TRIG35_PIO1_31
#undef DMA1_TRIG36_PIO1_10
#undef DMA1_TRIG36_PIO1_24
#undef DMA1_TRIG36_PIO1_25
#undef DMA1_TRIG36_PIO1_26
#undef DMA1_TRIG36_PIO1_27
#undef DMA1_TRIG36_PIO1_29
#undef DMA1_TRIG36_PIO1_30
#undef DMA1_TRIG36_PIO1_31
#undef DMA1_TRIG3_PIO1_10
#undef DMA1_TRIG3_PIO1_24
#undef DMA1_TRIG3_PIO1_25
#undef DMA1_TRIG3_PIO1_26
#undef DMA1_TRIG3_PIO1_27
#undef DMA1_TRIG3_PIO1_29
#undef DMA1_TRIG3_PIO1_30
#undef DMA1_TRIG3_PIO1_31
#undef DMA1_TRIG4_PIO1_10
#undef DMA1_TRIG4_PIO1_24
#undef DMA1_TRIG4_PIO1_25
#undef DMA1_TRIG4_PIO1_26
#undef DMA1_TRIG4_PIO1_27
#undef DMA1_TRIG4_PIO1_29
#undef DMA1_TRIG4_PIO1_30
#undef DMA1_TRIG4_PIO1_31
#undef DMA1_TRIG5_PIO1_10
#undef DMA1_TRIG5_PIO1_24
#undef DMA1_TRIG5_PIO1_25
#undef DMA1_TRIG5_PIO1_26
#undef DMA1_TRIG5_PIO1_27
#undef DMA1_TRIG5_PIO1_29
#undef DMA1_TRIG5_PIO1_30
#undef DMA1_TRIG5_PIO1_31
#undef DMA1_TRIG6_PIO1_10
#undef DMA1_TRIG6_PIO1_24
#undef DMA1_TRIG6_PIO1_25
#undef DMA1_TRIG6_PIO1_26
#undef DMA1_TRIG6_PIO1_27
#undef DMA1_TRIG6_PIO1_29
#undef DMA1_TRIG6_PIO1_30
#undef DMA1_TRIG6_PIO1_31
#undef DMA1_TRIG7_PIO1_10
#undef DMA1_TRIG7_PIO1_24
#undef DMA1_TRIG7_PIO1_25
#undef DMA1_TRIG7_PIO1_26
#undef DMA1_TRIG7_PIO1_27
#undef DMA1_TRIG7_PIO1_29
#undef DMA1_TRIG7_PIO1_30
#undef DMA1_TRIG7_PIO1_31
#undef DMA1_TRIG8_PIO1_10
#undef DMA1_TRIG8_PIO1_24
#undef DMA1_TRIG8_PIO1_25
#undef DMA1_TRIG8_PIO1_26
#undef DMA1_TRIG8_PIO1_27
#undef DMA1_TRIG8_PIO1_29
#undef DMA1_TRIG8_PIO1_30
#undef DMA1_TRIG8_PIO1_31
#undef DMA1_TRIG9_PIO1_10
#undef DMA1_TRIG9_PIO1_24
#undef DMA1_TRIG9_PIO1_25
#undef DMA1_TRIG9_PIO1_26
#undef DMA1_TRIG9_PIO1_27
#undef DMA1_TRIG9_PIO1_29
#undef DMA1_TRIG9_PIO1_30
#undef DMA1_TRIG9_PIO1_31
#undef DMIC0_CLK23_PIO3_1
#undef DMIC0_CLK45_PIO3_2
#undef DMIC0_CLK67_PIO3_3
#undef DMIC0_DATA23_PIO3_1
#undef DMIC0_DATA45_PIO3_2
#undef DMIC0_DATA67_PIO3_3
#undef FC0_CTS_SDA_SSEL0_PIO3_3
#undef FC0_RXD_SDA_MOSI_DATA_PIO3_2
#undef FC0_TXD_SCL_MISO_WS_PIO3_1
#undef FC10_CTS_SDA_SSELN0_PIO3_11
#undef FC10_RTS_SCL_SSELN1_PIO3_12
#undef FC10_RXD_SDA_MOSI_PIO3_10
#undef FC10_SCK_PIO3_8
#undef FC10_SSELN2_PIO3_13
#undef FC10_SSELN3_PIO3_14
#undef FC10_TXD_SCL_MISO_PIO3_9
#undef FC12_CTS_SDA_SSELN0_PIO5_0
#undef FC12_RTS_SCL_SSELN1_PIO5_1
#undef FC12_SSELN2_PIO5_2
#undef FC12_SSELN3_PIO5_3
#undef FC1_RXD_SDA_MOSI_DATA_PIO4_6
#undef FC1_SCK_PIO4_4
#undef FC1_TXD_SCL_MISO_WS_PIO4_5
#undef FC2_CTS_SDA_SSEL0_PIO4_14
#undef FC2_RTS_SCL_SSEL1_PIO4_15
#undef FC2_RXD_SDA_MOSI_DATA_PIO4_13
#undef FC2_SCK_PIO4_11
#undef FC2_SSEL2_PIO4_16
#undef FC2_SSEL3_PIO4_17
#undef FC2_TXD_SCL_MISO_WS_PIO4_12
#undef FC4_CTS_SDA_SSEL0_PIO5_15
#undef FC4_RTS_SCL_SSEL1_PIO5_16
#undef FC4_SSEL2_PIO5_17
#undef FC4_SSEL3_PIO5_18
#undef FC5_CTS_SDA_SSEL0_PIO3_18
#undef FC5_RXD_SDA_MOSI_DATA_PIO3_17
#undef FC5_SCK_PIO3_15
#undef FC5_TXD_SCL_MISO_WS_PIO3_16
#undef FC6_RXD_SDA_MOSI_DATA_PIO3_27
#undef FC6_SCK_PIO3_25
#undef FC6_TXD_SCL_MISO_WS_PIO3_26
#undef FC7_CTS_SDA_SSEL0_PIO4_3
#undef FC7_RTS_SCL_SSEL1_PIO4_4
#undef FC7_RXD_SDA_MOSI_DATA_PIO4_2
#undef FC7_SCK_PIO4_0
#undef FC7_SSEL2_PIO4_5
#undef FC7_SSEL3_PIO4_6
#undef FC7_TXD_SCL_MISO_WS_PIO4_1
#undef FC8_CTS_SDA_SSEL0_PIO2_8
#undef FC8_CTS_SDA_SSEL1_PIO2_9
#undef FC8_RXD_SDA_MOSI_DATA_PIO2_7
#undef FC8_SCK_PIO2_5
#undef FC8_SSEL2_PIO2_10
#undef FC8_SSEL3_PIO2_11
#undef FC8_TXD_SCL_MISO_WS_PIO2_6
#undef FLEXIO0_IO12_PIO5_0
#undef FLEXIO0_IO13_PIO5_1
#undef FLEXIO0_IO14_PIO5_2
#undef FLEXIO0_IO15_PIO5_3
#undef FLEXIO0_TRIG0_PIO3_12
#undef FLEXIO0_TRIG1_PIO3_13
#undef FLEXSPI0_DATA4_PIO1_24
#undef FLEXSPI0_DATA5_PIO1_25
#undef FLEXSPI0_DATA6_PIO1_26
#undef FLEXSPI0_DATA7_PIO1_27
#undef FLEXSPI0_SCLK_N_PIO1_29
#undef FLEXSPI0_SS1_N_PIO1_29
#undef FLEXSPI1_DATA0_PIO4_12
#undef FLEXSPI1_DATA1_PIO4_13
#undef FLEXSPI1_DATA2_PIO4_14
#undef FLEXSPI1_DATA3_PIO4_15
#undef FLEXSPI1_DATA4_PIO5_15
#undef FLEXSPI1_DATA5_PIO5_16
#undef FLEXSPI1_DATA6_PIO5_17
#undef FLEXSPI1_DATA7_PIO5_18
#undef FLEXSPI1_DQS_PIO4_16
#undef FLEXSPI1_SCLK_N_PIO4_17
#undef FLEXSPI1_SCLK_PIO4_11
#undef FLEXSPI1_SS0_N_PIO4_18
#undef FLEXSPI1_SS1_N_PIO4_17
#undef FREQME_IN0_PIO1_10
#undef FREQME_IN0_PIO4_0
#undef FREQME_IN1_PIO1_10
#undef FREQME_IN1_PIO4_0
#undef GPIO_INT_BMAT_PIO3_21
#undef GPIO_PIO110_PIO1_10
#undef GPIO_PIO124_PIO1_24
#undef GPIO_PIO125_PIO1_25
#undef GPIO_PIO126_PIO1_26
#undef GPIO_PIO127_PIO1_27
#undef GPIO_PIO129_PIO1_29
#undef GPIO_PIO130_PIO1_30
#undef GPIO_PIO131_PIO1_31
#undef GPIO_PIO20_PIO2_0
#undef GPIO_PIO210_PIO2_10
#undef GPIO_PIO211_PIO2_11
#undef GPIO_PIO21_PIO2_1
#undef GPIO_PIO228_PIO2_28
#undef GPIO_PIO22_PIO2_2
#undef GPIO_PIO23_PIO2_3
#undef GPIO_PIO24_PIO2_4
#undef GPIO_PIO25_PIO2_5
#undef GPIO_PIO26_PIO2_6
#undef GPIO_PIO27_PIO2_7
#undef GPIO_PIO28_PIO2_8
#undef GPIO_PIO29_PIO2_9
#undef GPIO_PIO310_PIO3_10
#undef GPIO_PIO311_PIO3_11
#undef GPIO_PIO312_PIO3_12
#undef GPIO_PIO313_PIO3_13
#undef GPIO_PIO314_PIO3_14
#undef GPIO_PIO315_PIO3_15
#undef GPIO_PIO316_PIO3_16
#undef GPIO_PIO317_PIO3_17
#undef GPIO_PIO318_PIO3_18
#undef GPIO_PIO319_PIO3_19
#undef GPIO_PIO31_PIO3_1
#undef GPIO_PIO320_PIO3_20
#undef GPIO_PIO321_PIO3_21
#undef GPIO_PIO325_PIO3_25
#undef GPIO_PIO326_PIO3_26
#undef GPIO_PIO327_PIO3_27
#undef GPIO_PIO32_PIO3_2
#undef GPIO_PIO33_PIO3_3
#undef GPIO_PIO38_PIO3_8
#undef GPIO_PIO39_PIO3_9
#undef GPIO_PIO40_PIO4_0
#undef GPIO_PIO411_PIO4_11
#undef GPIO_PIO412_PIO4_12
#undef GPIO_PIO413_PIO4_13
#undef GPIO_PIO414_PIO4_14
#undef GPIO_PIO415_PIO4_15
#undef GPIO_PIO416_PIO4_16
#undef GPIO_PIO417_PIO4_17
#undef GPIO_PIO418_PIO4_18
#undef GPIO_PIO41_PIO4_1
#undef GPIO_PIO42_PIO4_2
#undef GPIO_PIO43_PIO4_3
#undef GPIO_PIO44_PIO4_4
#undef GPIO_PIO45_PIO4_5
#undef GPIO_PIO46_PIO4_6
#undef GPIO_PIO50_PIO5_0
#undef GPIO_PIO515_PIO5_15
#undef GPIO_PIO516_PIO5_16
#undef GPIO_PIO517_PIO5_17
#undef GPIO_PIO518_PIO5_18
#undef GPIO_PIO51_PIO5_1
#undef GPIO_PIO52_PIO5_2
#undef GPIO_PIO53_PIO5_3
#undef I3C1_PUR_PIO3_3
